In [1]:
import pandas as pd
import numpy as np

In [2]:
maasSozluk={"isim":["osman","levent","atlas","fatma"],
         "departman" :["yazılım","satış","pazarlama","yazılım"],
        "maas":[200,100,50,300]
        }

In [3]:
maasDataFrame=pd.DataFrame(maasSozluk)

In [4]:
maasDataFrame

     isim  departman  maas
0   osman    yazılım   200
1  levent      satış   100
2   atlas  pazarlama    50
3   fatma    yazılım   300

In [5]:
maasDataFrame["departman"].unique()

array(['yazılım', 'satış', 'pazarlama'], dtype=object)

In [6]:
maasDataFrame["departman"].nunique()

3

In [7]:
maasDataFrame["departman"].value_counts()

yazılım      2
satış        1
pazarlama    1
Name: departman, dtype: int64

In [10]:
def brutNete(maas):
    return maas * 0.66

In [11]:
maasDataFrame["maas"].apply(brutNete)

0    132.0
1     66.0
2     33.0
3    198.0
Name: maas, dtype: float64

In [12]:
maasDataFrame.isnull()

    isim  departman   maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [18]:
yeniBirVeri={"karakter sınıfı" :["south park","south park","simpson","simpson","simpson"],
            "karakter ismi": ["carman","kenny","homer","bart","bart"],
             "karakter yas":[9,10,50,20,10]
            }

In [19]:
karakterDF=pd.DataFrame(yeniBirVeri)

In [20]:
karakterDF

  karakter sınıfı karakter ismi  karakter yas
0      south park        carman             9
1      south park         kenny            10
2         simpson         homer            50
3         simpson          bart            20
4         simpson          bart            10

In [23]:
karakterDF.pivot_table(values="karakter yas", index=["karakter sınıfı","karakter ismi"],aggfunc=np.sum)

                               karakter yas
karakter sınıfı karakter ismi
simpson         bart                     30
                homer                    50
south park      carman                    9
                kenny                    10